'''
开发一个商城。
需求：
买XXXX东西
资金结算
XXXXX水果商城
金钱加在一起。
水果：
编号、名称、单价、数量、质量、产地
'''
'''
print("====================================================")
print("|                     Farnk商城                      |")
print("|  编号、名称、单价、数量、 质量、 产地                  |")
print("|   1    苹果  3💴   890    AA  苹果树上              |")
print("|   2    榴莲  50💴  300    SS    榴莲树上你和我       |")
print("|   3     🍇   10💴 98765   SSR  新疆的葡萄架的葡萄藤上 |")
print("|   4     🥑   80    700    C--  浇水能长出来         |")
print("|   5     火锅  180   9    UR    成都                |")
num=(3*890+50*300+10*98765+80*700+180*9)
print(type(int(num)))
print("总价格:",num)
'''

print("-----------------------------------------------------")
print("|                     Averie商城                      |")
print("|  日期    服装名称    价格/件     库存数量    销售量/每日    |")
print("|  1号     羽绒服      253.6      500        10          |")
print("|  2号     牛仔裤      86.3       600        60        |")
print("|  3号      风衣	     96.8	    335	       43       |")
print("|  4号	   皮草	     135.9      855	       63       |")
print("|  5号	   T血	     65.8	    632        63       |")
print("|  6号	   衬衫	     49.3	    562	       120      |")
print("|  7号	  牛仔裤	     86.3	    600        72      |")
print("|  8号	  羽绒服      253.6	    500	       69      |")
print("|  9号	  牛仔裤	     86.3	    600	       35       |")
print("|  10号    羽绒服     	253.6	    500	       140      |")
print("|  11号	  牛仔裤	     86.3	    600	       90       |")
print("|  12号	  皮草	     135.9	    855	       24       |")
print("|  13号	   T血	     65.8	    632        45        |")
print("|  14号	   风衣	     96.8	    335	       25        |")
print("|  15号    牛仔裤     	86.3	    600    	   60        |")
print("|  16号      T血	     65.8	    632	       129       |")
print("|  17号	  羽绒服	     253.6	    500	       10        |")
print("|  18号	   风衣	     96.8	    335    	   43        |")
print("|  19号 	   T血	     65.8	    632    	   63       |")
print("|  20号	  牛仔裤	     86.3	    600	       60       |")
print("|  21号	   皮草   	 135.9	    855	       63       |")
print("|  22号	   风衣	     96.8	    335        60       |")
print("|  23号      T血	     65.8	    632	       58       |")
print("|  24号	   牛仔裤	 86.3	    600	       140      |")
print("|  25号	    T血	     65.8      	632    	   48       |")
print("|  26号	   风衣	     96.8	    335	       43       |")
print("|  27号	    皮草	     135.9	    855        57       |")
print("|  28号	   羽绒服	 253.6	    500        10       |")
print("|  29号   	T血	     65.8    	632        63       |")
print("|  30号	   风衣	     96.8	    335        78       |")


num1=(253.6*(10+69+140+10+10)+86.3*(60+72+35+90+60+60+140)+96.8*(43+25+43+60+43+78)
     +135.9*(63+24+63+57)+65.8*(63+45+129+63+58+48+63)+49.3*120)
print(type(int(num1)))
print("总销售额:",int(num1))

num2=((10+69+140+10+10)+(60+72+35+90+60+60+140)+(43+25+43+60+43+78)+(63+24+63+57)+(63+45+129+63+58+48+63)+120)/30
print("平均每日销售数量：",int(num2))

num=(10+69+140+10+10)+(60+72+35+90+60+60+140)+(43+25+43+60+43+78)+(63+24+63+57)+(63+45+129+63+58+48+63)+120

num3=(10+69+140+10+10)/num
print("羽绒服的销售占比：",num3)

num4=(60+72+35+90+60+60+140)/num
print("牛仔裤的销售占比：",num4)

num5=(43+25+43+60+43+78)/num
print("风衣的销售占比：",num5)

num6=(63+24+63+57)/num
print("皮草的销售占比：",num6)

num7=(63+45+129+63+58+48+63)/num
print("T恤的销售占比：",num7)

num8=120/num
print("衬衫的销售占比：",num8)